FadyFaheem/Stream32/boards/waveshare-esp32-s3-touch-lcd-4-3b/firmware/components/waveshare_bsp/waveshare_bsp.c
/* Waveshare ESP32-S3 Touch LCD 4.3B BSP. */

#include <stdio.h>
#include <string.h>
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_panel_rgb.h"
#include "esp_lcd_panel_io.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_check.h"
#include "esp_vfs_fat.h"
#include "esp_spiffs.h"
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "esp_lcd_touch_gt911.h"

#include "bsp/display.h"
#include "bsp/touch.h"
#include "bsp/esp32_s3_touch_lcd_4.h"
#include "bsp_err_check.h"

static const char *TAG = "waveshare_bsp";

static i2c_master_bus_handle_t i2c_handle = NULL;
static i2c_master_dev_handle_t ch422g_mode_handle = NULL;
static i2c_master_dev_handle_t ch422g_output_handle = NULL;
static bool i2c_initialized = false;
static lv_display_t *disp;
static lv_indev_t *disp_indev = NULL;
sdmmc_card_t *bsp_sdcard = NULL;
static esp_lcd_touch_handle_t tp = NULL;
static esp_lcd_panel_handle_t panel_handle = NULL;
static bool s_invert = false;
#define BSP_ROTATION_BASE_DEGREES 0
static uint16_t s_rotation = 0;
static bool s_display_awake = false;
static uint8_t s_ch422g_output = BSP_CH422G_LCD_BL | BSP_CH422G_LCD_RST |
    BSP_CH422G_TOUCH_RST | BSP_CH422G_SD_CS;

/**************************************************************************************************
 * I2C Functions
 **************************************************************************************************/
esp_err_t bsp_i2c_init(void)
{
    if (i2c_initialized) {
        return ESP_OK;
    }

    i2c_master_bus_config_t i2c_bus_conf = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .sda_io_num = BSP_I2C_SDA,
        .scl_io_num = BSP_I2C_SCL,
        .i2c_port = BSP_I2C_NUM,
        .flags.enable_internal_pullup = true,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_new_master_bus(&i2c_bus_conf, &i2c_handle));

    const i2c_device_config_t mode_config = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = BSP_CH422G_MODE_ADDRESS,
        .scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ,
    };
    BSP_ERROR_CHECK_RETURN_ERR(i2c_master_bus_add_device(
        i2c_handle, &mode_config, &ch422g_mode_handle));

    i2c_device_config_t output_config = mode_config;
    output_config.device_address = BSP_CH422G_OUTPUT_ADDRESS;
    BSP_ERROR_CHECK_RETURN_ERR(i2c_master_bus_add_device(
        i2c_handle, &output_config, &ch422g_output_handle));

    i2c_initialized = true;
    return ESP_OK;
}

esp_err_t bsp_i2c_deinit(void)
{
    BSP_ERROR_CHECK_RETURN_ERR(i2c_master_bus_rm_device(ch422g_output_handle));
    BSP_ERROR_CHECK_RETURN_ERR(i2c_master_bus_rm_device(ch422g_mode_handle));
    BSP_ERROR_CHECK_RETURN_ERR(i2c_del_master_bus(i2c_handle));
    ch422g_output_handle = NULL;
    ch422g_mode_handle = NULL;
    i2c_handle = NULL;
    i2c_initialized = false;
    return ESP_OK;
}

i2c_master_bus_handle_t bsp_i2c_get_handle(void)
{
    bsp_i2c_init();
    return i2c_handle;
}

static esp_err_t bsp_i2c_device_probe(uint8_t addr)
{
    return i2c_master_probe(i2c_handle, addr, 100);
}

static esp_err_t ch422g_write(i2c_master_dev_handle_t handle, uint8_t value)
{
    return i2c_master_transmit(handle, &value, sizeof(value), 1000);
}

static esp_err_t ch422g_init(void)
{
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    const uint8_t output_mode = 0x01;
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_write(ch422g_mode_handle, output_mode));
    return ch422g_write(ch422g_output_handle, s_ch422g_output);
}

static esp_err_t ch422g_set_output(uint8_t mask, bool high)
{
    if (high) {
        s_ch422g_output |= mask;
    } else {
        s_ch422g_output &= (uint8_t)~mask;
    }

    return ch422g_write(ch422g_output_handle, s_ch422g_output);
}

static esp_err_t ch422g_set_outputs(uint8_t value)
{
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_write(ch422g_output_handle, value));
    s_ch422g_output = value;
    return ESP_OK;
}

/**************************************************************************************************
 * SPIFFS Functions
 **************************************************************************************************/
esp_err_t bsp_spiffs_mount(void)
{
    esp_vfs_spiffs_conf_t conf = {
        .base_path = CONFIG_BSP_SPIFFS_MOUNT_POINT,
        .partition_label = CONFIG_BSP_SPIFFS_PARTITION_LABEL,
        .max_files = CONFIG_BSP_SPIFFS_MAX_FILES,
#ifdef CONFIG_BSP_SPIFFS_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
    };

    esp_err_t ret_val = esp_vfs_spiffs_register(&conf);
    BSP_ERROR_CHECK_RETURN_ERR(ret_val);

    size_t total = 0, used = 0;
    ret_val = esp_spiffs_info(conf.partition_label, &total, &used);
    if (ret_val != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get SPIFFS partition information (%s)", esp_err_to_name(ret_val));
    } else {
        ESP_LOGI(TAG, "Partition size: total: %d, used: %d", total, used);
    }

    return ret_val;
}

esp_err_t bsp_spiffs_unmount(void)
{
    return esp_vfs_spiffs_unregister(CONFIG_BSP_SPIFFS_PARTITION_LABEL);
}

/**************************************************************************************************
 * SD Card Functions
 **************************************************************************************************/
esp_err_t bsp_sdcard_mount(void)
{
    return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t bsp_sdcard_unmount(void)
{
    return ESP_ERR_NOT_SUPPORTED;
}

/**************************************************************************************************
 * Display Functions
 **************************************************************************************************/
esp_err_t bsp_display_brightness_init(void)
{
    return bsp_display_backlight_on();
}

esp_err_t bsp_display_brightness_set(int brightness_percent)
{
    (void)brightness_percent;
    return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t bsp_display_backlight_off(void)
{
    if (ch422g_output_handle == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    s_display_awake = false;
    return ch422g_set_output(BSP_CH422G_LCD_BL, false);
}

esp_err_t bsp_display_backlight_on(void)
{
    if (ch422g_output_handle == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    s_display_awake = true;
    return ch422g_set_output(BSP_CH422G_LCD_BL, true);
}

esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel, esp_lcd_panel_io_handle_t *ret_io)
{
    (void)config;
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_init());

    esp_lcd_rgb_panel_config_t rgb_config = {
        .clk_src = LCD_CLK_SRC_DEFAULT,
        .sram_trans_align = 4,
        .psram_trans_align = 64,
        .data_width = BSP_RGB_DATA_WIDTH,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .de_gpio_num = BSP_LCD_DE,
        .pclk_gpio_num = BSP_LCD_PCLK,
        .vsync_gpio_num = BSP_LCD_VSYNC,
        .hsync_gpio_num = BSP_LCD_HSYNC,
        .disp_gpio_num = BSP_LCD_DISP,
        .data_gpio_nums = {
            BSP_LCD_DATA0, BSP_LCD_DATA1, BSP_LCD_DATA2, BSP_LCD_DATA3,
            BSP_LCD_DATA4, BSP_LCD_DATA5, BSP_LCD_DATA6, BSP_LCD_DATA7,
            BSP_LCD_DATA8, BSP_LCD_DATA9, BSP_LCD_DATA10, BSP_LCD_DATA11,
            BSP_LCD_DATA12, BSP_LCD_DATA13, BSP_LCD_DATA14, BSP_LCD_DATA15,
        },
        .timings = {
            .pclk_hz = BSP_LCD_PIXEL_CLOCK_HZ,
            .h_res = BSP_LCD_H_RES,
            .v_res = BSP_LCD_V_RES,
            .hsync_pulse_width = 4,
            .hsync_back_porch = 8,
            .hsync_front_porch = 8,
            .vsync_pulse_width = 4,
            .vsync_back_porch = 8,
            .vsync_front_porch = 8,
            .flags.pclk_active_neg = 1,
        },
        .flags.fb_in_psram = 1,
        .num_fbs = CONFIG_BSP_LCD_RGB_BUFFER_NUMS,
        .bounce_buffer_size_px = BSP_LCD_DRAW_BUFF_SIZE,
    };
    BSP_ERROR_CHECK_RETURN_ERR(esp_lcd_new_rgb_panel(&rgb_config, &panel_handle));
    BSP_ERROR_CHECK_RETURN_ERR(esp_lcd_panel_init(panel_handle));
    BSP_ERROR_CHECK_RETURN_ERR(bsp_display_brightness_init());

    if (ret_panel) {
        *ret_panel = panel_handle;
    }
    if (ret_io) {
        *ret_io = NULL;
    }

    return ESP_OK;
}

esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    (void)config;
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_init());

    const gpio_config_t interrupt_output = {
        .pin_bit_mask = 1ULL << BSP_LCD_TOUCH_INT,
        .mode = GPIO_MODE_OUTPUT,
    };
    BSP_ERROR_CHECK_RETURN_ERR(gpio_config(&interrupt_output));
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_set_outputs(
        BSP_CH422G_USB_SEL | BSP_CH422G_LCD_RST | BSP_CH422G_LCD_BL));
    vTaskDelay(pdMS_TO_TICKS(100));
    BSP_ERROR_CHECK_RETURN_ERR(gpio_set_level(BSP_LCD_TOUCH_INT, 0));
    vTaskDelay(pdMS_TO_TICKS(100));
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_set_output(BSP_CH422G_TOUCH_RST, true));
    vTaskDelay(pdMS_TO_TICKS(200));
    BSP_ERROR_CHECK_RETURN_ERR(ch422g_set_outputs(
        BSP_CH422G_SD_CS | BSP_CH422G_LCD_RST |
        BSP_CH422G_LCD_BL | BSP_CH422G_TOUCH_RST));
    BSP_ERROR_CHECK_RETURN_ERR(gpio_reset_pin(BSP_LCD_TOUCH_INT));

    const esp_lcd_touch_config_t tp_cfg = {
        .x_max = BSP_LCD_H_RES,
        .y_max = BSP_LCD_V_RES,
        .rst_gpio_num = GPIO_NUM_NC,
        .int_gpio_num = GPIO_NUM_NC,
        .levels = {
            .reset = 0,
            .interrupt = 0,
        },
        .flags = {
            .swap_xy = 0,
            .mirror_x = 0,
            .mirror_y = 0,
        },
    };
    esp_lcd_panel_io_handle_t tp_io_handle = NULL;
    esp_lcd_panel_io_i2c_config_t tp_io_config;

    if (ESP_OK == bsp_i2c_device_probe(ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS)) {
        ESP_LOGI(TAG, "Touch 0x5d found");
        esp_lcd_panel_io_i2c_config_t config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
        memcpy(&tp_io_config, &config, sizeof(config));
    } else if (ESP_OK == bsp_i2c_device_probe(ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS_BACKUP)) {
        ESP_LOGI(TAG, "Touch 0x14 found");
        esp_lcd_panel_io_i2c_config_t config = ESP_LCD_TOUCH_IO_I2C_GT911_CONFIG();
        config.dev_addr = ESP_LCD_TOUCH_IO_I2C_GT911_ADDRESS_BACKUP;
        memcpy(&tp_io_config, &config, sizeof(config));
    } else {
        ESP_LOGE(TAG, "Touch not found");
        return ESP_ERR_NOT_FOUND;
    }
    tp_io_config.scl_speed_hz = CONFIG_BSP_I2C_CLK_SPEED_HZ;
    ESP_RETURN_ON_ERROR(esp_lcd_new_panel_io_i2c(i2c_handle, &tp_io_config, &tp_io_handle), TAG, "");
    return esp_lcd_touch_new_i2c_gt911(tp_io_handle, &tp_cfg, ret_touch);
}

static lv_display_t *bsp_display_lcd_init()
{
    esp_lcd_panel_io_handle_t io_handle = NULL;
    bsp_display_config_t disp_config = {0};

    BSP_ERROR_CHECK_RETURN_NULL(bsp_display_new(&disp_config, &panel_handle, &io_handle));

    int buffer_size = 0;
#if CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR
    buffer_size = BSP_LCD_H_RES * BSP_LCD_V_RES;
#else
    buffer_size = BSP_LCD_H_RES * LVGL_BUFFER_HEIGHT;
#endif

    const lvgl_port_display_cfg_t disp_cfg = {
        .io_handle = io_handle,
        .panel_handle = panel_handle,
        .buffer_size = buffer_size,
        .monochrome = false,
        .hres = BSP_LCD_H_RES,
        .vres = BSP_LCD_V_RES,
#if LVGL_VERSION_MAJOR >= 9
        .color_format = LV_COLOR_FORMAT_RGB565,
#endif
        .rotation = {
            .swap_xy = false,
            .mirror_x = false,
            .mirror_y = false,
        },
        .flags = {
            .sw_rotate = true,
            .buff_dma = false,
#if CONFIG_BSP_DISPLAY_LVGL_PSRAM
            .buff_spiram = false,
#endif
#if CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH
            .full_refresh = 1,
#elif CONFIG_BSP_DISPLAY_LVGL_DIRECT_MODE
            .direct_mode = 1,
#endif
#if LVGL_VERSION_MAJOR >= 9
            .swap_bytes = false,
#endif
        }
    };
    const lvgl_port_display_rgb_cfg_t rgb_cfg = {
        .flags = {
#if CONFIG_BSP_LCD_RGB_BOUNCE_BUFFER_MODE
            .bb_mode = 1,
#else
            .bb_mode = 0,
#endif
#if CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR
            .avoid_tearing = true,
#else
            .avoid_tearing = false,
#endif
        }
    };

    return lvgl_port_add_disp_rgb(&disp_cfg, &rgb_cfg);
}

static lv_indev_t *bsp_display_indev_init(lv_display_t *disp)
{
    BSP_ERROR_CHECK_RETURN_NULL(bsp_touch_new(NULL, &tp));
    assert(tp);

    const lvgl_port_touch_cfg_t touch_cfg = {
        .disp = disp,
        .handle = tp,
    };

    return lvgl_port_add_touch(&touch_cfg);
}

lv_display_t *bsp_display_start(void)
{
    bsp_display_cfg_t cfg = {
        .lvgl_port_cfg = ESP_LVGL_PORT_INIT_CONFIG()
    };
    return bsp_display_start_with_config(&cfg);
}

lv_display_t *bsp_display_start_with_config(const bsp_display_cfg_t *cfg)
{
    BSP_ERROR_CHECK_RETURN_NULL(lvgl_port_init(&cfg->lvgl_port_cfg));
    BSP_NULL_CHECK(disp = bsp_display_lcd_init(), NULL);
    BSP_NULL_CHECK(disp_indev = bsp_display_indev_init(disp), NULL);

    /* A stored orientation replaces this default from deck_settings_apply. */
    bsp_display_set_rotation(0);

    return disp;
}

lv_indev_t *bsp_display_get_input_dev(void)
{
    return disp_indev;
}

void bsp_display_rotate(lv_display_t *disp, lv_display_rotation_t rotation)
{
    lv_disp_set_rotation(disp, rotation);
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    return lvgl_port_lock(timeout_ms);
}

void bsp_display_unlock(void)
{
    lvgl_port_unlock();
}

esp_err_t bsp_display_set_awake(bool awake)
{
    if (panel_handle == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    return awake
        ? bsp_display_backlight_on()
        : bsp_display_backlight_off();
}

esp_err_t bsp_display_set_brightness(uint32_t brightness_percent)
{
    if (brightness_percent > 100) {
        return ESP_ERR_INVALID_ARG;
    }

    return bsp_display_brightness_set((int)brightness_percent);
}

esp_err_t bsp_display_set_invert(bool invert)
{
    (void)invert;
    return ESP_ERR_NOT_SUPPORTED;
}

bool bsp_display_invert(void)
{
    return s_invert;
}

/* The direct RGB panel has no command bus for scan-order changes. LVGL rotates
    flushed buffers and applies the same transform to touch coordinates. */
esp_err_t bsp_display_set_rotation(uint16_t degrees)
{
    static const lv_display_rotation_t ROTATIONS[] = {
        LV_DISPLAY_ROTATION_0,
        LV_DISPLAY_ROTATION_90,
        LV_DISPLAY_ROTATION_180,
        LV_DISPLAY_ROTATION_270,
    };

    if (degrees % 90 != 0 || degrees > 270) {
        return ESP_ERR_INVALID_ARG;
    }

    if (disp == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    const uint16_t applied = (degrees + BSP_ROTATION_BASE_DEGREES) % 360;

    lvgl_port_lock(0);
    lv_display_set_rotation(disp, ROTATIONS[applied / 90]);
    s_rotation = degrees;
    lvgl_port_unlock();
    return ESP_OK;
}

uint16_t bsp_display_rotation(void)
{
    return s_rotation;
}

/* Mirroring is a MADCTL bit, which an RGB panel driven straight from the
   framebuffer does not have. */
esp_err_t bsp_display_set_flip(bool flip_x, bool flip_y)
{
    (void)flip_x;
    (void)flip_y;
    return ESP_ERR_NOT_SUPPORTED;
}

void bsp_display_flip(bool *flip_x, bool *flip_y)
{
    if (flip_x != NULL) {
        *flip_x = false;
    }

    if (flip_y != NULL) {
        *flip_y = false;
    }
}

/* GT911 is a capacitive controller that reports screen coordinates directly,
   so there is nothing to calibrate and no raw sample to expose. */
bool bsp_touch_read_raw(uint16_t *raw_x, uint16_t *raw_y)
{
    (void)raw_x;
    (void)raw_y;
    return false;
}

esp_err_t bsp_touch_set_calibration(const float *coefficients)
{
    (void)coefficients;
    return ESP_ERR_NOT_SUPPORTED;
}
